"""
4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,…
Количество элементов (n) вводится с клавиатуры.
https://drive.google.com/file/d/1u8qGPy_gWb9HIuexGyWB_4o4ACk36n5P/view?usp=sharing
"""
n = int(input('Введите число элементов ряда 1, -0.5, 0.25, -0.125...: '))
s = 1
if n == 1:
    s = 1
else:
    for i in range(2, n + 1):
        if n % 2 == 0:
            el = -1 / 2**(n-1)
        else:
            el = 1 / 2**(n-1)
        s += el

print(f'Сумма {n} элементов ряда 1, -0.5, 0.25, -0.125... = {s}')

